## Problema 7

#### Você foi convidado para chefiar a seção de orçamentos ou a seção técnica da Companhia MB.
#### Qual seria a sua decisão?

In [1]:
import pandas as pd

In [2]:
df_instrucao_tecnica = pd.DataFrame(
    {
        "Instrução":["Fundamental","Médio","Superior","Total"],
        "Frequência":[15,30,5,50],
        "Porcentagem":[15*100/50,30*100/50,5*100/50,50*100/50]
    }
)
df_instrucao_orcamentos = pd.DataFrame(
    {
        "Instrução":["Fundamental","Médio","Superior","Total"],
        "Frequência":[12,18,6,36],
        "Porcentagem":[12*100/36,18*100/36,6*100/36,36*100/36]
    }
)
df_salario_tecnica = pd.DataFrame(
    {
        "Classe de Salários":["7.50 |-- 10.50","10.50 |-- 13.50","13.50 |-- 16.50","16.50 |-- 19.50","Total"],
        "Frequência":[14,17,11,8,50],
        "Porcentagem":[14*100/50,17*100/50,11*100/50,8*100/50,50*100/50]
    }
)
df_salario_orcamentos = pd.DataFrame(
    {
        "Classe de Salários":["4.00 |-- 8.00","8.00 |-- 12.00","12.00 |-- 16.00","16.00 |-- 20.00","20.00 |-- 24.00","Total"],
        "Frequência":[10,12,8,5,1,36],
        "Porcentagem":[10*100/36,12*100/36,8*100/36,5*100/36,1*100/36,36*100/36]
    }
)

In [3]:
df_instrucao_tecnica

     Instrução  Frequência  Porcentagem
0  Fundamental          15         30.0
1        Médio          30         60.0
2     Superior           5         10.0
3        Total          50        100.0

In [4]:
df_instrucao_orcamentos

     Instrução  Frequência  Porcentagem
0  Fundamental          12    33.333333
1        Médio          18    50.000000
2     Superior           6    16.666667
3        Total          36   100.000000

In [5]:
df_salario_tecnica

  Classe de Salários  Frequência  Porcentagem
0     7.50 |-- 10.50          14         28.0
1    10.50 |-- 13.50          17         34.0
2    13.50 |-- 16.50          11         22.0
3    16.50 |-- 19.50           8         16.0
4              Total          50        100.0

In [6]:
df_salario_orcamentos

  Classe de Salários  Frequência  Porcentagem
0      4.00 |-- 8.00          10    27.777778
1     8.00 |-- 12.00          12    33.333333
2    12.00 |-- 16.00           8    22.222222
3    16.00 |-- 20.00           5    13.888889
4    20.00 |-- 24.00           1     2.777778
5              Total          36   100.000000

R: Eu escolheria a área técnica.
O grau de instrução é um pouco mais baixo mas os salários são um pouco mais altos na base da pirâmide.
Isso significa que os funcionários dessa área são mais bem pagos.